app/controllers/high_scores_controller.rb

SELECT "high_scores".* FROM "high_scores"
---
  def index
    @high_scores = HighScore.all

SELECT "high_scores".* FROM "high_scores" WHERE "high_scores"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "high_scores" SET "score" = 24, "updated_at" = '2013-10-13 05:12:28.494776' WHERE "high_scores"."id" = 1
---
  def show
    # get this from web service
    @@glob += 1

    @data_cont =         [
        [500, 2], [108, 900], [25, 500], [10, 33], [330, 95],
        [410, 12], [47, 44], [250, 670], [85, 210], [220, 88], [60,1500]
    ].to_json


    @data_cont_1 =         [
        [500, 200], [108, 900], [25, 500], [10, 33], [330, 95],
        [410, 12], [47, 44], [250, 670], [85, 210], [220, 88], [60,1500]
    ].to_json


    @high_score = HighScore.find(params[:id])
    @high_score.score += 1


    @high_score.save()

SELECT "high_scores".* FROM "high_scores" WHERE "high_scores"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @high_score = HighScore.find(params[:id])

INSERT INTO "high_scores" ("created_at", "game", "score", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 15 Dec 2013 06:11:17 UTC +00:00], ["game", ""], ["score", nil], ["updated_at", Sun, 15 Dec 2013 06:11:17 UTC +00:00]]
---
  def create
    @high_score = HighScore.new(params[:high_score])

    respond_to do |format|
      if @high_score.save

SELECT "high_scores".* FROM "high_scores" WHERE "high_scores"."id" = ? LIMIT 1  [["id", "2"]]
---
  def update
    @high_score = HighScore.find(params[:id])